#+title: keymaps
#+author: Freja
#+startup: content

*** layers
#+name: generate-layer
#+begin_src elisp :var input=adj_layout keycode=keycode_table modcode=mod_table :results value
(defun get-keycode (name)
  "Returns the keycode if it exists."
  (let ((code (nth 1 (assoc name keycode))))
    (if (not code)
        (error "The key %s does't exist - yet." name)
        code)))

(defun get-mod (name)
  "Returns the mod if it exists."
  (let ((code (nth 1 (assoc name modcode))))
    (if (not code)
        (error "The mod %s does't exist." name)
        code)))

(setq input (flatten-tree input) ; flat is justice
      result "")

(unless (eq (length input) 64)
  (error "Either you use a different keyboard with a different matrix, or you missed a col or two, it's %d long instead of 64 long" (length input)))

(while input
  (let ((word (pop input)))
    (unless (eq word "")
      (let* ((expr (split-string word))
             (pre (car expr)))
        ;(print expr)
        (pcase pre
          ("&nop"       (setq result (concat result "XXXXXXX, ")))
          ("&trns"      (setq result (concat result "_______, ")))
          ("&kp"  ; normal keycode
            (let ((key (get-keycode (nth 1 expr))))
              (setq result (concat result key ", "))))
          ("&kps"  ; shifted keycode
            (let ((key (get-keycode (nth 1 expr))))
              (setq result (concat result (format "S(%s), " key)))))
          ("&tg"  ; toggle layer
            (let ((layer (nth 1 expr)))
              (setq result (concat result (format "TG(%s), " layer)))))
          ("&lt"  ; layer tap
            (let ((layer (nth 1 expr))
                  (key (get-keycode (nth 2 expr))))
              (setq result (concat result (format "LT(%s, %s), " layer key)))))
          ("&mo"  ; layer hold
            (let ((layer (nth 1 expr)))
              (setq result (concat result (format "MO(%s), " layer)))))
          ("&mt"  ; mod tap
            (let ((modkey (get-mod (nth 1 expr)))
                  (key (get-keycode (nth 2 expr))))
              (setq result (concat result (format "MT(%s, %s), " modkey key)))))
          (any  ; unknown key
           (let ((x (% (1+ (length input)) 16))
                 (y (1+ (/ (length input) 16))))
             (error "Unknown key %s at %d:%d" any x y))))))))

(substring result 0 -2)  ; cutting of the last ", "
;(s-chop-suffix ", " result) <- doesn't work outside emacs
#+end_src

#+RESULTS: generate-layer
: XXXXXXX, EH_LEFT, EH_RGHT, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, RGB_HUI, RGB_SAI, RGB_VAI, RGB_MOD, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, RGB_HUD, RGB_SAD, RGB_VAD, RGB_RMOD, XXXXXXX, XXXXXXX, RESET, EEP_RST, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, _______, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX

*** combos
#+name: get-combocount
#+begin_src elisp :main no :var in=combo-table :result value
(length in)
#+end_src

#+name: generate-combosequence
#+begin_src elisp :main no :var in=combo-table keycode=keycode_table :result value
(defun get-keycode (name)
  "Returns the keycode if it exists."
  (let ((code (nth 1 (assoc name keycode))))
    (if (not code)
        (error "The key %s in the combo doesn't exist" name)
        code)))

(setq result ""
      id 0  ; too lazy to create names, I just use a running number
      in (cdr in))  ; get the cdr since the first row is purely descriptive

(while in
  (setq row (pop in))
  (setq result (concat result (format "const uint16_t PROGMEM unique_combo%d[] = { " id)))
  (while (cdr row)
    (let ((key (pop (cdr row))))
      (setq result (concat result (get-keycode key) ", "))))
  (setq result (concat result "COMBO_END, };\n"))
  (setq id (1+ id)))

(print result)
#+end_src

#+RESULTS: generate-combosequence
: const uint16_t PROGMEM unique_combo0[] = { KC_K, KC_F, COMBO_END, };
: const uint16_t PROGMEM unique_combo1[] = { KC_M, KC_P, COMBO_END, };

#+name: generate-combocombination
#+begin_src elisp :main no :var in=combo-table keycode=keycode_table :result value
(defun get-keycode (name)
  "Returns the keycode if it exists."
  (let ((code (nth 1 (assoc name keycode))))
    (if (not code)
        (error "The key %s in the combo doesn't exist" name)
        code)))

(setq result "combo_t key_combos[COMBO_COUNT] = { "
      id 0
      in (cdr in))  ; discard the first row

(while in
  (setq key (car (pop in))
        result (concat result (format "COMBO(unique_combo%d, %s), " id (get-keycode key)))
        id (1+ id)))

(concat result "};")
#+end_src

#+RESULTS: generate-combocombination
: combo_t key_combos[COMBO_COUNT] = { 'COMBO(unique_combo0, KC_Y), COMBO(unique_combo1, KC_Q), };


